# --- Core Tools ---
brew "git"
brew "gh"                     # GitHub CLI
brew "coreutils"
brew "zsh"
brew "tmux"
brew "htop"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"                    # prettier `cat`
brew "tree"
brew "python@3.12"
brew "node"

# --- AI & ML Tools ---
brew "ollama"                 # Local LLM host
brew "weaviate"               # Optional RAG vector DB
brew "redis"                  # Fast local kv cache
brew "pyenv"                  # Python version management
brew "pyenv-virtualenv"       # Virtual environment management
brew "pipx"                   # Isolated CLI python tools
brew "poetry"                 # Modern Python dependency management

# --- NLP / RAG Helpers ---
brew "openblas"               # Needed for numpy/scipy on mac
brew "libomp"                 # Enables multi-threading in CoreML & transformers

# --- Text & Markdown Tools ---
brew "glow"                   # Markdown preview
brew "mdcat"
brew "git-delta"              # Better git diff visualization
brew "exa"                    # Better directory listing
brew "tldr"                   # Simplified command documentation
brew "fzf"                    # Fuzzy finding
brew "zoxide"                 # Smarter directory navigation

# --- Editors ---
cask "visual-studio-code"
brew "neovim"

# --- GUI / Workflow Tools ---
cask "raycast"
cask "rectangle"
cask "arc"

# --- Optional: For container work ---
# brew "docker"
# brew "colima"
