# --- Core ---
brew "bash"
brew "bash-completion@2"
brew "git"
brew "gh"
brew "tmux"
brew "htop"
brew "jq"

# --- Search & Navigation ---
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "tree"

# --- Git ---
brew "git-delta"
brew "lazygit"

# --- Text ---
brew "glow"
brew "mdcat"
brew "tldr"

# --- Languages & Build ---
brew "go"
brew "just"
brew "node"

# --- Infrastructure ---
brew "docker"
brew "ollama"
brew "signal-cli"
brew "hashicorp/tap/vault"
brew "awscli"
brew "aws-vault"

# --- Shell / workflow ---
brew "direnv"

# --- Apps ---
cask "orbstack"
cask "visual-studio-code"

# --- VS Code Extensions ---
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "openai.chatgpt"
