# --- Core ---
brew "git"
brew "gh"
brew "zsh"
brew "tmux"
brew "htop"
brew "jq"

# --- Search & Navigation ---
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "tree"

# --- Git ---
brew "git-delta"
brew "lazygit"

# --- Text ---
brew "glow"
brew "mdcat"
brew "tldr"

# --- Languages & Build ---
brew "go"
brew "just"
brew "node"

# --- Infrastructure ---
brew "docker"
brew "ollama"
brew "signal-cli"
brew "hashicorp/tap/vault"

# --- Apps ---
cask "orbstack"
